Scripts/mutants/dateOnlyToCoversTheWholeDay.patch
diff --git a/Sources/TelegramKBMCP/ToolHandler.swift b/Sources/TelegramKBMCP/ToolHandler.swift
index 50544ca..a6b18a6 100644
--- a/Sources/TelegramKBMCP/ToolHandler.swift
+++ b/Sources/TelegramKBMCP/ToolHandler.swift
@@ -106,7 +106,7 @@ public enum TGKBServer {
         }
         switch try args.date("to") {
         case .instant(let d)?: filter.to = d
-        case .day(start: let d)?: filter.before = d.addingTimeInterval(86_400)
+        case .day(start: let d)?: filter.to = d.addingTimeInterval(86_400)
         case nil: break
         }
         let mode = try args.enumerated("mode", as: Store.SearchMode.self) ?? .both
