Scripts/mutants/deletedTextPostsFallThroughToMedia.patch
diff --git a/Sources/TelegramKBSync/ChatImport.swift b/Sources/TelegramKBSync/ChatImport.swift
index 64619a7..d2a9735 100644
--- a/Sources/TelegramKBSync/ChatImport.swift
+++ b/Sources/TelegramKBSync/ChatImport.swift
@@ -183,8 +183,7 @@ public struct ChatImport: Sendable {
     func verify(_ posts: [Post], channel: String, timeZone: TimeZone,
                 fetcher: PageFetcher) async throws -> (messageID: Int, rawChannelID: Int64) {
         let newest = posts.reversed()
-        let candidates = newest.filter { !$0.text.isEmpty }.prefix(Self.candidates)
-                       + newest.filter { $0.text.isEmpty }.prefix(Self.candidates)
+        let candidates = Array(newest.prefix(Self.candidates))
         var verified: (post: Post, rawID: Int64)?
         for post in candidates {
             if let rawID = try await probe(post, channel: channel, fetcher: fetcher) {
