Scripts/mutants/embedWithoutPeer.patch
diff --git a/Sources/TelegramKBSync/ChatImport.swift b/Sources/TelegramKBSync/ChatImport.swift
index 00c7fd1..442a841 100644
--- a/Sources/TelegramKBSync/ChatImport.swift
+++ b/Sources/TelegramKBSync/ChatImport.swift
@@ -173,7 +173,7 @@ public struct ChatImport: Sendable {
     /// text check then compares two empty strings and contributes nothing — accepted trade-off,
     /// since the alternative is refusing a valid export (PR #3, review round 2).
     func verify(_ posts: [Post], channel: String,
-                fetcher: PageFetcher) async throws -> (messageID: Int, rawChannelID: Int64) {
+                fetcher: PageFetcher) async throws -> (messageID: Int, rawChannelID: Int64?) {
         let newest = posts.reversed()
         let candidates = newest.filter { !$0.text.isEmpty } + newest.filter { $0.text.isEmpty }
         let newestCandidates = candidates.prefix(Self.candidates)
@@ -192,12 +192,7 @@ public struct ChatImport: Sendable {
             guard offset == 0 else {
                 throw ImportError.wrongZone(channel: channel, messageID: post.id.messageID, offset: offset)
             }
-            // A verified page that names no chat cannot feed the identity checks — returning nil
-            // here once let a marked-verified import skip them and store identity 0 (PR #3).
-            guard let rawID = try MessageEmbed.rawChannelID(html: page.body) else {
-                throw ImportError.malformedEmbed(url)
-            }
-            return (post.id.messageID, rawID)
+            return (post.id.messageID, try MessageEmbed.rawChannelID(html: page.body))
         }
         throw ImportError.notFound(channel: channel, tried: newestCandidates.map(\.id.messageID))
     }
