Scripts/mutants/emptyFullWalkKeepsBounds.patch
diff --git a/Sources/TelegramKBStore/Store.swift b/Sources/TelegramKBStore/Store.swift
index 94cb217..159a365 100644
--- a/Sources/TelegramKBStore/Store.swift
+++ b/Sources/TelegramKBStore/Store.swift
@@ -469,7 +469,7 @@ extension Store.CrawlState {
         // `full` starts at the newest page and so may replace the bounds — but a walk that saw
         // NOTHING has seen nothing to replace them with. Writing its nils back erased the range
         // and sent every later sync into a fresh backfill.
-        if full { return (lowest ?? self.lowest, highest ?? self.highest) }
+        if full { return (lowest, highest) }
         return (lowest: [self.lowest, lowest].compactMap { $0 }.min(),
                 highest: [self.highest, highest].compactMap { $0 }.max())
     }
