Scripts/mutants/findLinksPages.patch
diff --git a/Sources/TelegramKBMCP/ToolHandler.swift b/Sources/TelegramKBMCP/ToolHandler.swift
index db231ff..9fcc431 100644
--- a/Sources/TelegramKBMCP/ToolHandler.swift
+++ b/Sources/TelegramKBMCP/ToolHandler.swift
@@ -148,7 +148,7 @@ public enum TGKBServer {
             content: [.text(text: render(links, total: results.total), annotations: nil, _meta: nil)],
             structuredContent: FindLinksOutput(
                 links: links, total: results.total,
-                next_cursor: results.nextCursor,
+                next_cursor: nil,
                 index_moved_since_cursor: results.indexMovedSinceCursor))
     }
 
