Scripts/mutants/fingerprintFieldsAreUnambiguous.patch
diff --git a/Sources/TelegramKBStore/SearchFilter.swift b/Sources/TelegramKBStore/SearchFilter.swift
index d3359e1..13b820c 100644
--- a/Sources/TelegramKBStore/SearchFilter.swift
+++ b/Sources/TelegramKBStore/SearchFilter.swift
@@ -128,7 +128,7 @@ extension Store {
         /// shift the boundaries so two different result sets produced one fingerprint and
         /// accepted each other's cursors (PR #2, round 2).
         static func fingerprint(fields: [String]) -> UInt64 {
-            hash(fields.map { "\($0.utf8.count):\($0)" }.joined())
+            hash(fields.joined(separator: "\u{1}"))
         }
 
         static func hash(_ material: String) -> UInt64 {
