Scripts/mutants/foreignCursorRejected.patch
diff --git a/Sources/TelegramKBMCP/ToolHandler.swift b/Sources/TelegramKBMCP/ToolHandler.swift
index db231ff..775bce7 100644
--- a/Sources/TelegramKBMCP/ToolHandler.swift
+++ b/Sources/TelegramKBMCP/ToolHandler.swift
@@ -158,7 +158,7 @@ public enum TGKBServer {
         do {
             return try body()
         } catch let e as Store.SearchError {
-            throw MCPError.invalidParams(e.description)
+            throw MCPError.internalError(e.description)
         }
     }
 
