Scripts/mutants/hugePageSizeIsClamped.patch
diff --git a/Sources/TelegramKBStore/Search.swift b/Sources/TelegramKBStore/Search.swift
index a56457d..065c0cf 100644
--- a/Sources/TelegramKBStore/Search.swift
+++ b/Sources/TelegramKBStore/Search.swift
@@ -133,7 +133,7 @@ extension Store {
         // Clamped both ways. `Int.max` as a page size made the substring bound `end + words.count`
         // overflow and trap (PR #2, round 2); with the page and the offset both bounded, every sum
         // below stays far from the edge.
-        let cap = min(max(limit, 0), Self.maxPageSize)
+        let cap = max(limit, 0)
         let fingerprint = Cursor.fingerprint(query: query, mode: mode, filter: filter)
         var offset = 0, cursorGeneration: UInt64?
         if let cursor {
