Scripts/mutants/idUnderAnotherName.patch
diff --git a/Sources/TelegramKBStore/Store.swift b/Sources/TelegramKBStore/Store.swift
index fd5b62d..4b92290 100644
--- a/Sources/TelegramKBStore/Store.swift
+++ b/Sources/TelegramKBStore/Store.swift
@@ -542,17 +542,6 @@ extension Store {
                         "@\(username) is stored as chat \(known); the claim is for chat \(rawChannelID)")
                 }
             }
-            if let rawChannelID {
-                let others = try String.fetchAll(db, sql: """
-                    SELECT username FROM channel WHERE rawChannelID = ? AND username != ?
-                    ORDER BY username
-                    """, arguments: [rawChannelID, username])
-                if !others.isEmpty {
-                    throw StoreError.channelIDConflict(
-                        "chat \(rawChannelID) is already stored as @\(others.joined(separator: ", @")) — renamed? "
-                      + "Until S7 one chat can have only one row")
-                }
-            }
             try db.execute(sql: """
                 INSERT INTO channel (username, rawChannelID, reachability) VALUES (?, 0, ?)
                 ON CONFLICT(username) DO NOTHING
