Scripts/mutants/linkCursorSurvivesReresolution.patch
diff --git a/Sources/TelegramKBStore/Search.swift b/Sources/TelegramKBStore/Search.swift
index 580713a..d386777 100644
--- a/Sources/TelegramKBStore/Search.swift
+++ b/Sources/TelegramKBStore/Search.swift
@@ -317,7 +317,7 @@ extension Store {
             key = url
         }
         let cap = min(max(limit, 0), maxPageSize)
-        let fingerprint = Cursor.fingerprint(fields: ["links", predicate, key])
+        let fingerprint = Cursor.fingerprint(fields: ["links", predicate, argument])
         let (offset, _, cursorGeneration) = try Cursor.resume(cursor, fingerprint: fingerprint, cap: cap)
 
         let hits = try LinkHit.fetchAll(db, sql: """
