Scripts/mutants/linksFollowResolution.patch
diff --git a/Sources/TelegramKBStore/Search.swift b/Sources/TelegramKBStore/Search.swift
index 03a5da6..fbde404 100644
--- a/Sources/TelegramKBStore/Search.swift
+++ b/Sources/TelegramKBStore/Search.swift
@@ -271,7 +271,7 @@ extension Store {
                 let effective = try String.fetchOne(db,
                     sql: "SELECT resolvedCanonical FROM urlResolution WHERE urlCanonical = ?",
                     arguments: [canonical]) ?? canonical
-                predicate = "COALESCE(r.resolvedCanonical, l.urlCanonical) = ?"
+                predicate = "l.urlCanonical = ?"
                 arguments = [effective]
             } else {
                 predicate = "l.urlRaw = ?"
