Scripts/mutants/linksMatchRawWhenNotCanonicalisable.patch
diff --git a/Sources/TelegramKBStore/Search.swift b/Sources/TelegramKBStore/Search.swift
index 8e93257..2efeb5d 100644
--- a/Sources/TelegramKBStore/Search.swift
+++ b/Sources/TelegramKBStore/Search.swift
@@ -306,7 +306,7 @@ extension Store {
                 arguments: [canonical]) ?? canonical
             predicate = "COALESCE(r.resolvedCanonical, l.urlCanonical) = ?"
         } else {
-            predicate = "l.urlRaw = ?"
+            predicate = "l.urlCanonical = ?"
             argument = url
         }
         let cap = min(max(limit, 0), maxPageSize)
