Scripts/mutants/linksPageThroughACursor.patch
diff --git a/Sources/TelegramKBStore/Search.swift b/Sources/TelegramKBStore/Search.swift
index f3676bf..4ba19fa 100644
--- a/Sources/TelegramKBStore/Search.swift
+++ b/Sources/TelegramKBStore/Search.swift
@@ -330,7 +330,7 @@ extension Store {
             FROM link l LEFT JOIN urlResolution r ON r.urlCanonical = l.urlCanonical
             WHERE \(predicate)
             ORDER BY l.channelUsername, l.messageID, l.id LIMIT ? OFFSET ?
-            """, arguments: [argument, cap, offset])
+            """, arguments: [argument, cap, 0])
         let total = try Int.fetchOne(db, sql: """
             SELECT COUNT(*) FROM link l
             LEFT JOIN urlResolution r ON r.urlCanonical = l.urlCanonical
