Scripts/mutants/pageCapIsNotCompletion.patch
diff --git a/Sources/TelegramKBIngest/WebPreviewSource.swift b/Sources/TelegramKBIngest/WebPreviewSource.swift
index 64ebf39..bec9148 100644
--- a/Sources/TelegramKBIngest/WebPreviewSource.swift
+++ b/Sources/TelegramKBIngest/WebPreviewSource.swift
@@ -145,7 +145,7 @@ public struct WebPreviewSource: Sendable {
                                  updatedAt: Date(),
                                  // Only a walk that actually reached the end may claim this, and
                                  // a page-capped walk has not.
-                                 isBackfillComplete: reachedEnd && since == nil),
+                                 isBackfillComplete: since == nil),
             pagesFetched: pages,
             postCount: count,
             rawChannelID: rawChannelID,
