Scripts/mutants/reachedSinceIsReported.patch
diff --git a/Sources/TelegramKBIngest/WebPreviewSource.swift b/Sources/TelegramKBIngest/WebPreviewSource.swift
index 07eee7e..fdc4db6 100644
--- a/Sources/TelegramKBIngest/WebPreviewSource.swift
+++ b/Sources/TelegramKBIngest/WebPreviewSource.swift
@@ -155,7 +155,7 @@ public struct WebPreviewSource: Sendable {
                                  rawChannelID)
             }
 
-            if let since, ids.allSatisfy({ $0 <= since }) { reachedSince = true; break }
+            if let since, ids.allSatisfy({ $0 <= since }) { break }
 
             // Page by the ids actually returned, never by a stride: ids are non-contiguous
             // (an album occupies several while rendering as one post), so a decrementing cursor
