Scripts/mutants/rebuildDropsStaleMappings.patch
diff --git a/Sources/TelegramKBStore/Store.swift b/Sources/TelegramKBStore/Store.swift
index faa1fac..20aa09d 100644
--- a/Sources/TelegramKBStore/Store.swift
+++ b/Sources/TelegramKBStore/Store.swift
@@ -169,10 +169,7 @@ public struct Store: Sendable {
                 // `matchCount` counts it while the page join through `ftsMap` cannot return it.
                 // A total that disagrees with its own page is the failure `total` exists to
                 // prevent, so all three rows go.
-                try db.execute(sql: "DELETE FROM postFTS WHERE rowid = ?", arguments: [rowid])
-                try db.execute(sql: "DELETE FROM postTrigram WHERE rowid = ?", arguments: [rowid])
-                try db.execute(sql: "DELETE FROM ftsMap WHERE rowid = ?", arguments: [rowid])
-                try bumpIndexGeneration(in: db)
+                _ = rowid
                 stale += 1
                 continue
             }
