Scripts/mutants/syncLeavesWALTruncated.patch
diff --git a/Sources/TelegramKBSync/ChannelSync.swift b/Sources/TelegramKBSync/ChannelSync.swift
index e8e9c20..1fc37c7 100644
--- a/Sources/TelegramKBSync/ChannelSync.swift
+++ b/Sources/TelegramKBSync/ChannelSync.swift
@@ -72,11 +72,6 @@ public struct ChannelSync: Sendable {
             }
             throw walkError
         }
-        do {
-            try store.truncateWAL()
-        } catch {
-            outcome.walCleanupFailed = true
-        }
         return outcome
     }
 
