Scripts/mutants/tiedLinkHitsPageInATotalOrder.patch
diff --git a/Sources/TelegramKBStore/Search.swift b/Sources/TelegramKBStore/Search.swift
index f3676bf..d7e7a0c 100644
--- a/Sources/TelegramKBStore/Search.swift
+++ b/Sources/TelegramKBStore/Search.swift
@@ -329,7 +329,7 @@ extension Store {
                    COALESCE(r.resolvedCanonical, l.urlCanonical) AS eff
             FROM link l LEFT JOIN urlResolution r ON r.urlCanonical = l.urlCanonical
             WHERE \(predicate)
-            ORDER BY l.channelUsername, l.messageID, l.id LIMIT ? OFFSET ?
+            ORDER BY l.channelUsername, l.messageID, l.id DESC LIMIT ? OFFSET ?
             """, arguments: [argument, cap, offset])
         let total = try Int.fetchOne(db, sql: """
             SELECT COUNT(*) FROM link l
