Scripts/mutants/undatedBlockIsUnreadable.patch
diff --git a/Sources/TelegramKBIngest/WebPreviewParser.swift b/Sources/TelegramKBIngest/WebPreviewParser.swift
index a2d3cf2..e08b563 100644
--- a/Sources/TelegramKBIngest/WebPreviewParser.swift
+++ b/Sources/TelegramKBIngest/WebPreviewParser.swift
@@ -66,14 +66,9 @@ public enum WebPreviewParser {
         let bodyEl = try message.select("div.tgme_widget_message_text.js-message_text").first()
         let text = try bodyEl.map(NodeText.text(of:)) ?? ""
 
-        // No readable date means the block is unreadable, full stop — a guessed date is worse
-        // than a dropped block, because `1970-01-01` sorts into searches and date filters as if
-        // it were real. The skip is counted through `skippedBlocks` to the sync's warning, the
-        // same path a missing `data-post` takes (`TD-25`; `MessageEmbed.post` already refuses
-        // such a page for the same reason).
-        guard let date = try message.select("time[datetime]").first()
-            .map({ try $0.attr("datetime") })
-            .flatMap({ try? Self.iso.parse($0) }) else { return nil }
+        let date = try message.select("time[datetime]").first()
+            .map { try $0.attr("datetime") }
+            .flatMap { try? Self.iso.parse($0) } ?? Date(timeIntervalSince1970: 0)
 
         let author = try message.select("span.tgme_widget_message_from_author").first()
             .map(NodeText.text(of:))
