Scripts/mutants/unverifiedGroupRefused.patch
diff --git a/Sources/TelegramKBStore/Store.swift b/Sources/TelegramKBStore/Store.swift
index 500ab09..e6f355f 100644
--- a/Sources/TelegramKBStore/Store.swift
+++ b/Sources/TelegramKBStore/Store.swift
@@ -428,11 +428,6 @@ extension Store {
     public func ensureChannel(username: String, reachability: Channel.Reachability) throws {
         try dbPool.write { db in
             try assertChannelLease(in: db, channel: username)
-            if reachability == .webPreview,
-               try String.fetchOne(db, sql: "SELECT reachability FROM channel WHERE username = ?",
-                                   arguments: [username]) == Channel.Reachability.group.rawValue {
-                throw StoreError.channelImported(username)
-            }
             try db.execute(sql: """
                 INSERT INTO channel (username, rawChannelID, reachability) VALUES (?, 0, ?)
                 ON CONFLICT(username) DO NOTHING
